<a href="https://colab.research.google.com/github/nksinghnitc/Python-for-Data-Analysis/blob/master/Pandas_Dataframe_Part_1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

<h3>DATAFRAME</h3>

In [1]:
from google.colab import drive
drive.mount('/content/drive')

Go to this URL in a browser: https://accounts.google.com/o/oauth2/auth?client_id=947318989803-6bn6qk8qdgf4n4g3pfee6491hc0brc4i.apps.googleusercontent.com&redirect_uri=urn%3aietf%3awg%3aoauth%3a2.0%3aoob&response_type=code&scope=email%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdocs.test%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive.photos.readonly%20https%3a%2f%2fwww.googleapis.com%2fauth%2fpeopleapi.readonly

Enter your authorization code:
··········
Mounted at /content/drive

In [0]:
import pandas as pd

In [0]:
path="/content/drive/My Drive/Python Data Analysis/3.Python-Pandas/files/"

In [0]:
nba = pd.read_csv(path + "nba.csv")

***Introduction to `Attributes`***

In [5]:
nba.index

RangeIndex(start=0, stop=458, step=1)

In [6]:
nba.values

array([['Avery Bradley', 'Boston Celtics', 0.0, ..., 180.0, 'Texas',
        7730337.0],
       ['Jae Crowder', 'Boston Celtics', 99.0, ..., 235.0, 'Marquette',
        6796117.0],
       ['John Holland', 'Boston Celtics', 30.0, ..., 205.0,
        'Boston University', nan],
       ...,
       ['Tibor Pleiss', 'Utah Jazz', 21.0, ..., 256.0, nan, 2900000.0],
       ['Jeff Withey', 'Utah Jazz', 24.0, ..., 231.0, 'Kansas', 947276.0],
       [nan, nan, nan, ..., nan, nan, nan]], dtype=object)

In [7]:
nba.dtypes

Name         object
Team         object
Number      float64
Position     object
Age         float64
Height       object
Weight      float64
College      object
Salary      float64
dtype: object

In [8]:
nba.shape

(458, 9)

In [9]:
nba.ndim

2

In [10]:
nba.size

4122

In [11]:
nba.columns

Index(['Name', 'Team', 'Number', 'Position', 'Age', 'Height', 'Weight',
       'College', 'Salary'],
      dtype='object')

In [12]:
nba.axes

[RangeIndex(start=0, stop=458, step=1),
 Index(['Name', 'Team', 'Number', 'Position', 'Age', 'Height', 'Weight',
        'College', 'Salary'],
       dtype='object')]

***The `.head(), .tail(), .info(), .get_dtype_counts(), .sum()` Methods***

In [13]:
nba.head()

            Name            Team  Number  ... Weight            College     Salary
0  Avery Bradley  Boston Celtics     0.0  ...  180.0              Texas  7730337.0
1    Jae Crowder  Boston Celtics    99.0  ...  235.0          Marquette  6796117.0
2   John Holland  Boston Celtics    30.0  ...  205.0  Boston University        NaN
3    R.J. Hunter  Boston Celtics    28.0  ...  185.0      Georgia State  1148640.0
4  Jonas Jerebko  Boston Celtics     8.0  ...  231.0                NaN  5000000.0

[5 rows x 9 columns]

In [14]:
nba.tail()

             Name       Team  Number Position  ...  Height Weight  College     Salary
453  Shelvin Mack  Utah Jazz     8.0       PG  ...     6-3  203.0   Butler  2433333.0
454     Raul Neto  Utah Jazz    25.0       PG  ...     6-1  179.0      NaN   900000.0
455  Tibor Pleiss  Utah Jazz    21.0        C  ...     7-3  256.0      NaN  2900000.0
456   Jeff Withey  Utah Jazz    24.0        C  ...     7-0  231.0   Kansas   947276.0
457           NaN        NaN     NaN      NaN  ...     NaN    NaN      NaN        NaN

[5 rows x 9 columns]

In [17]:
nba.info()
#Note : If any column having of int type having missing value the while reading datatype of column will be change to float. Ex-Age,Number

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 458 entries, 0 to 457
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      457 non-null    object
 1   Team      457 non-null    object
 2   Number    457 non-null    float64
 3   Position  457 non-null    object
 4   Age       457 non-null    float64
 5   Height    457 non-null    object
 6   Weight    457 non-null    float64
 7   College   373 non-null    object
 8   Salary    446 non-null    float64
dtypes: float64(4), object(5)
memory usage: 32.3+ KB

In [19]:
rev=pd.read_csv(path + "revenue.csv",index_col="Date")
print(len(rev))
rev.head()

10

        New York  Los Angeles  Miami
Date
1/1/16       985          122    499
1/2/16       738          788    534
1/3/16        14           20    933
1/4/16       730          904    885
1/5/16       114           71    253

In [20]:
rev.sum(axis = "columns")

Date
1/1/16     1606
1/2/16     2060
1/3/16      967
1/4/16     2519
1/5/16      438
1/6/16     1935
1/7/16     1234
1/8/16     2313
1/9/16     2623
1/10/16     555
dtype: int64

In [21]:
rev.sum(axis = "index")

New York       5475
Los Angeles    5134
Miami          5641
dtype: int64

In [22]:
rev.sum(axis=0)

New York       5475
Los Angeles    5134
Miami          5641
dtype: int64

In [23]:
rev.sum(axis=1)

Date
1/1/16     1606
1/2/16     2060
1/3/16      967
1/4/16     2519
1/5/16      438
1/6/16     1935
1/7/16     1234
1/8/16     2313
1/9/16     2623
1/10/16     555
dtype: int64

***Select One Column from a `DataFrame`***

In [0]:
nba = pd.read_csv(path + "nba.csv")

In [25]:
nba["Team"].head()

0    Boston Celtics
1    Boston Celtics
2    Boston Celtics
3    Boston Celtics
4    Boston Celtics
Name: Team, dtype: object

In [27]:
nba.Team.head()

0    Boston Celtics
1    Boston Celtics
2    Boston Celtics
3    Boston Celtics
4    Boston Celtics
Name: Team, dtype: object

***Select Two or More Columns from A `DataFrame`***

In [0]:
nba = pd.read_csv(path + "nba.csv")

In [29]:
nba[["Team", "Name"]].head()

             Team           Name
0  Boston Celtics  Avery Bradley
1  Boston Celtics    Jae Crowder
2  Boston Celtics   John Holland
3  Boston Celtics    R.J. Hunter
4  Boston Celtics  Jonas Jerebko

In [30]:
nba[["Salary", "Team", "Name"]].tail()

        Salary       Team          Name
453  2433333.0  Utah Jazz  Shelvin Mack
454   900000.0  Utah Jazz     Raul Neto
455  2900000.0  Utah Jazz  Tibor Pleiss
456   947276.0  Utah Jazz   Jeff Withey
457        NaN        NaN           NaN

In [31]:
select = ["Salary", "Team", "Name"]
nba[select].head()

      Salary            Team           Name
0  7730337.0  Boston Celtics  Avery Bradley
1  6796117.0  Boston Celtics    Jae Crowder
2        NaN  Boston Celtics   John Holland
3  1148640.0  Boston Celtics    R.J. Hunter
4  5000000.0  Boston Celtics  Jonas Jerebko

***`Add New Column` to `DataFrame`***

In [0]:
nba = pd.read_csv(path + "nba.csv")

In [33]:
nba["Sport"] = "Basketball"
nba.head()

            Name            Team  ...     Salary       Sport
0  Avery Bradley  Boston Celtics  ...  7730337.0  Basketball
1    Jae Crowder  Boston Celtics  ...  6796117.0  Basketball
2   John Holland  Boston Celtics  ...        NaN  Basketball
3    R.J. Hunter  Boston Celtics  ...  1148640.0  Basketball
4  Jonas Jerebko  Boston Celtics  ...  5000000.0  Basketball

[5 rows x 10 columns]

In [34]:
nba["League"] = "National Basketball Association"
nba.head()

            Name            Team  ...       Sport                           League
0  Avery Bradley  Boston Celtics  ...  Basketball  National Basketball Association
1    Jae Crowder  Boston Celtics  ...  Basketball  National Basketball Association
2   John Holland  Boston Celtics  ...  Basketball  National Basketball Association
3    R.J. Hunter  Boston Celtics  ...  Basketball  National Basketball Association
4  Jonas Jerebko  Boston Celtics  ...  Basketball  National Basketball Association

[5 rows x 11 columns]

In [0]:
nba = pd.read_csv(path + "nba.csv")

In [36]:
nba.insert(3, column = "Sport", value = "Basketball")
nba.head()

            Name            Team  Number  ... Weight            College     Salary
0  Avery Bradley  Boston Celtics     0.0  ...  180.0              Texas  7730337.0
1    Jae Crowder  Boston Celtics    99.0  ...  235.0          Marquette  6796117.0
2   John Holland  Boston Celtics    30.0  ...  205.0  Boston University        NaN
3    R.J. Hunter  Boston Celtics    28.0  ...  185.0      Georgia State  1148640.0
4  Jonas Jerebko  Boston Celtics     8.0  ...  231.0                NaN  5000000.0

[5 rows x 10 columns]

In [0]:
nba.insert(7, column = "League", value = "National Basketball Association")

In [38]:
nba.head()

            Name            Team  Number  ... Weight            College     Salary
0  Avery Bradley  Boston Celtics     0.0  ...  180.0              Texas  7730337.0
1    Jae Crowder  Boston Celtics    99.0  ...  235.0          Marquette  6796117.0
2   John Holland  Boston Celtics    30.0  ...  205.0  Boston University        NaN
3    R.J. Hunter  Boston Celtics    28.0  ...  185.0      Georgia State  1148640.0
4  Jonas Jerebko  Boston Celtics     8.0  ...  231.0                NaN  5000000.0

[5 rows x 11 columns]

***Broadcasting Operations using `.add(),.sub(),.mul(),.div()`***

In [0]:
nba = pd.read_csv(path + "nba.csv")

In [0]:
nba["Age"].add(5)
nba["Age"] + 5

nba["Salary"].sub(5000000)
nba["Salary"] - 5000000

nba["Weight"].mul(0.453592)
nba["Weight in Kilograms"] = nba["Weight"] * 0.453592

nba["Salary"].div(1000000)
nba["Salary in Millions"] = nba["Salary"] / 1000000

In [42]:
nba.head()

            Name            Team  ...  Weight in Kilograms Salary in Millions
0  Avery Bradley  Boston Celtics  ...            81.646560           7.730337
1    Jae Crowder  Boston Celtics  ...           106.594120           6.796117
2   John Holland  Boston Celtics  ...            92.986360                NaN
3    R.J. Hunter  Boston Celtics  ...            83.914520           1.148640
4  Jonas Jerebko  Boston Celtics  ...           104.779752           5.000000

[5 rows x 11 columns]

***The `.value_counts()` Method***

In [43]:
nba = pd.read_csv(path + "nba.csv")
nba.head()

            Name            Team  Number  ... Weight            College     Salary
0  Avery Bradley  Boston Celtics     0.0  ...  180.0              Texas  7730337.0
1    Jae Crowder  Boston Celtics    99.0  ...  235.0          Marquette  6796117.0
2   John Holland  Boston Celtics    30.0  ...  205.0  Boston University        NaN
3    R.J. Hunter  Boston Celtics    28.0  ...  185.0      Georgia State  1148640.0
4  Jonas Jerebko  Boston Celtics     8.0  ...  231.0                NaN  5000000.0

[5 rows x 9 columns]

In [44]:
nba["Team"].value_counts()

New Orleans Pelicans      19
Memphis Grizzlies         18
Milwaukee Bucks           16
New York Knicks           16
Indiana Pacers            15
Los Angeles Clippers      15
Utah Jazz                 15
Brooklyn Nets             15
Los Angeles Lakers        15
Washington Wizards        15
Portland Trail Blazers    15
Phoenix Suns              15
Miami Heat                15
Boston Celtics            15
Charlotte Hornets         15
Denver Nuggets            15
Chicago Bulls             15
Golden State Warriors     15
Philadelphia 76ers        15
Toronto Raptors           15
Cleveland Cavaliers       15
San Antonio Spurs         15
Dallas Mavericks          15
Detroit Pistons           15
Sacramento Kings          15
Houston Rockets           15
Oklahoma City Thunder     15
Atlanta Hawks             15
Minnesota Timberwolves    14
Orlando Magic             14
Name: Team, dtype: int64

In [45]:
nba["Position"].value_counts().head()

SG    102
PF    100
PG     92
SF     85
C      78
Name: Position, dtype: int64

In [46]:
nba["Weight"].value_counts().tail()

278.0    1
227.0    1
239.0    1
289.0    1
307.0    1
Name: Weight, dtype: int64

In [47]:
nba["Salary"].value_counts().head()

947276.0     31
845059.0     18
525093.0     13
981348.0      6
1100602.0     5
Name: Salary, dtype: int64

***The `.dropna()` Method***

In [0]:
nba = pd.read_csv(path + "nba.csv")

In [49]:
nba.tail()

             Name       Team  Number Position  ...  Height Weight  College     Salary
453  Shelvin Mack  Utah Jazz     8.0       PG  ...     6-3  203.0   Butler  2433333.0
454     Raul Neto  Utah Jazz    25.0       PG  ...     6-1  179.0      NaN   900000.0
455  Tibor Pleiss  Utah Jazz    21.0        C  ...     7-3  256.0      NaN  2900000.0
456   Jeff Withey  Utah Jazz    24.0        C  ...     7-0  231.0   Kansas   947276.0
457           NaN        NaN     NaN      NaN  ...     NaN    NaN      NaN        NaN

[5 rows x 9 columns]

In [50]:
nba.dropna(axis=0,how = "all").tail()

             Name       Team  Number  ... Weight   College     Salary
452    Trey Lyles  Utah Jazz    41.0  ...  234.0  Kentucky  2239800.0
453  Shelvin Mack  Utah Jazz     8.0  ...  203.0    Butler  2433333.0
454     Raul Neto  Utah Jazz    25.0  ...  179.0       NaN   900000.0
455  Tibor Pleiss  Utah Jazz    21.0  ...  256.0       NaN  2900000.0
456   Jeff Withey  Utah Jazz    24.0  ...  231.0    Kansas   947276.0

[5 rows x 9 columns]

In [52]:
nba.dropna(axis=0,how="any",subset = ["Salary", "College"]).tail()

              Name       Team  Number  ... Weight   College     Salary
449    Rodney Hood  Utah Jazz     5.0  ...  206.0      Duke  1348440.0
451  Chris Johnson  Utah Jazz    23.0  ...  206.0    Dayton   981348.0
452     Trey Lyles  Utah Jazz    41.0  ...  234.0  Kentucky  2239800.0
453   Shelvin Mack  Utah Jazz     8.0  ...  203.0    Butler  2433333.0
456    Jeff Withey  Utah Jazz    24.0  ...  231.0    Kansas   947276.0

[5 rows x 9 columns]

In [0]:
nba = pd.read_csv(path + "nba.csv")

In [55]:
nba.size

4122

In [0]:
nba.dropna(inplace = True,)

In [58]:
nba.size

3276

In [0]:
nba = pd.read_csv(path + "nba.csv")

In [0]:
nba.dropna(axis=0,how='all',inplace=True)

In [64]:
nba.tail()

             Name       Team  Number  ... Weight   College     Salary
452    Trey Lyles  Utah Jazz    41.0  ...  234.0  Kentucky  2239800.0
453  Shelvin Mack  Utah Jazz     8.0  ...  203.0    Butler  2433333.0
454     Raul Neto  Utah Jazz    25.0  ...  179.0       NaN   900000.0
455  Tibor Pleiss  Utah Jazz    21.0  ...  256.0       NaN  2900000.0
456   Jeff Withey  Utah Jazz    24.0  ...  231.0    Kansas   947276.0

[5 rows x 9 columns]

In [66]:
nba.dropna(axis=1,how='any').head() # Column Removal

            Name            Team  Number Position   Age Height  Weight
0  Avery Bradley  Boston Celtics     0.0       PG  25.0    6-2   180.0
1    Jae Crowder  Boston Celtics    99.0       SF  25.0    6-6   235.0
2   John Holland  Boston Celtics    30.0       SG  27.0    6-5   205.0
3    R.J. Hunter  Boston Celtics    28.0       SG  22.0    6-5   185.0
4  Jonas Jerebko  Boston Celtics     8.0       PF  29.0   6-10   231.0

***The `.fillna()` Method***

In [0]:
nba = pd.read_csv(path + "nba.csv")

In [68]:
nba.fillna(0)

              Name            Team  ...            College     Salary
0    Avery Bradley  Boston Celtics  ...              Texas  7730337.0
1      Jae Crowder  Boston Celtics  ...          Marquette  6796117.0
2     John Holland  Boston Celtics  ...  Boston University        0.0
3      R.J. Hunter  Boston Celtics  ...      Georgia State  1148640.0
4    Jonas Jerebko  Boston Celtics  ...                  0  5000000.0
..             ...             ...  ...                ...        ...
453   Shelvin Mack       Utah Jazz  ...             Butler  2433333.0
454      Raul Neto       Utah Jazz  ...                  0   900000.0
455   Tibor Pleiss       Utah Jazz  ...                  0  2900000.0
456    Jeff Withey       Utah Jazz  ...             Kansas   947276.0
457              0               0  ...                  0        0.0

[458 rows x 9 columns]

In [0]:
nba["Salary"].fillna(0, inplace = True)

In [70]:
nba.head()

            Name            Team  Number  ... Weight            College     Salary
0  Avery Bradley  Boston Celtics     0.0  ...  180.0              Texas  7730337.0
1    Jae Crowder  Boston Celtics    99.0  ...  235.0          Marquette  6796117.0
2   John Holland  Boston Celtics    30.0  ...  205.0  Boston University        0.0
3    R.J. Hunter  Boston Celtics    28.0  ...  185.0      Georgia State  1148640.0
4  Jonas Jerebko  Boston Celtics     8.0  ...  231.0                NaN  5000000.0

[5 rows x 9 columns]

In [0]:
nba["College"].fillna("No College", inplace = True)

In [72]:
nba.head()

            Name            Team  Number  ... Weight            College     Salary
0  Avery Bradley  Boston Celtics     0.0  ...  180.0              Texas  7730337.0
1    Jae Crowder  Boston Celtics    99.0  ...  235.0          Marquette  6796117.0
2   John Holland  Boston Celtics    30.0  ...  205.0  Boston University        0.0
3    R.J. Hunter  Boston Celtics    28.0  ...  185.0      Georgia State  1148640.0
4  Jonas Jerebko  Boston Celtics     8.0  ...  231.0         No College  5000000.0

[5 rows x 9 columns]

***The `.astype()` Method***

In [75]:
nba = pd.read_csv(path + "nba.csv").dropna(how = "all") # delete all blank rows while importing data
nba["Salary"].fillna(0, inplace = True)
nba["College"].fillna("None", inplace = True)
nba.head()

            Name            Team  Number  ... Weight            College     Salary
0  Avery Bradley  Boston Celtics     0.0  ...  180.0              Texas  7730337.0
1    Jae Crowder  Boston Celtics    99.0  ...  235.0          Marquette  6796117.0
2   John Holland  Boston Celtics    30.0  ...  205.0  Boston University        0.0
3    R.J. Hunter  Boston Celtics    28.0  ...  185.0      Georgia State  1148640.0
4  Jonas Jerebko  Boston Celtics     8.0  ...  231.0               None  5000000.0

[5 rows x 9 columns]

In [76]:
nba.dtypes

Name         object
Team         object
Number      float64
Position     object
Age         float64
Height       object
Weight      float64
College      object
Salary      float64
dtype: object

In [77]:
nba.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 457 entries, 0 to 456
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      457 non-null    object
 1   Team      457 non-null    object
 2   Number    457 non-null    float64
 3   Position  457 non-null    object
 4   Age       457 non-null    float64
 5   Height    457 non-null    object
 6   Weight    457 non-null    float64
 7   College   457 non-null    object
 8   Salary    457 non-null    float64
dtypes: float64(4), object(5)
memory usage: 35.7+ KB

In [0]:
nba["Salary"] = nba["Salary"].astype("int")

In [79]:
nba.head(3)

            Name            Team  Number  ... Weight            College   Salary
0  Avery Bradley  Boston Celtics     0.0  ...  180.0              Texas  7730337
1    Jae Crowder  Boston Celtics    99.0  ...  235.0          Marquette  6796117
2   John Holland  Boston Celtics    30.0  ...  205.0  Boston University        0

[3 rows x 9 columns]

In [88]:
nba["Number"] = nba["Number"].astype("int")
nba["Age"] = nba["Age"].astype("int")
nba.head(3)

            Name            Team  Number  ... Weight            College   Salary
0  Avery Bradley  Boston Celtics       0  ...  180.0              Texas  7730337
1    Jae Crowder  Boston Celtics      99  ...  235.0          Marquette  6796117
2   John Holland  Boston Celtics      30  ...  205.0  Boston University        0

[3 rows x 9 columns]

In [81]:
nba["Position"].unique()

array(['PG', 'SF', 'SG', 'PF', 'C'], dtype=object)

In [82]:
nba["Position"].nunique()

5

In [0]:
nba["Position"] = nba["Position"].astype("category")

In [0]:
nba["Team"] = nba["Team"].astype("category")

In [86]:
nba.head()

            Name            Team  Number  ... Weight            College   Salary
0  Avery Bradley  Boston Celtics     0.0  ...  180.0              Texas  7730337
1    Jae Crowder  Boston Celtics    99.0  ...  235.0          Marquette  6796117
2   John Holland  Boston Celtics    30.0  ...  205.0  Boston University        0
3    R.J. Hunter  Boston Celtics    28.0  ...  185.0      Georgia State  1148640
4  Jonas Jerebko  Boston Celtics     8.0  ...  231.0               None  5000000

[5 rows x 9 columns]

In [89]:
nba.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 457 entries, 0 to 456
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      457 non-null    object
 1   Team      457 non-null    category
 2   Number    457 non-null    int64
 3   Position  457 non-null    category
 4   Age       457 non-null    int64
 5   Height    457 non-null    object
 6   Weight    457 non-null    float64
 7   College   457 non-null    object
 8   Salary    457 non-null    int64
dtypes: category(2), float64(1), int64(3), object(3)
memory usage: 31.1+ KB

***The `.sort_values()` Method***

In [92]:
nba = pd.read_csv(path + "nba.csv").dropna(how='all')
nba.tail(3)

             Name       Team  Number Position  ...  Height Weight  College     Salary
454     Raul Neto  Utah Jazz    25.0       PG  ...     6-1  179.0      NaN   900000.0
455  Tibor Pleiss  Utah Jazz    21.0        C  ...     7-3  256.0      NaN  2900000.0
456   Jeff Withey  Utah Jazz    24.0        C  ...     7-0  231.0   Kansas   947276.0

[3 rows x 9 columns]

In [94]:
nba.sort_values("Name", ascending = False).head()

                Name                    Team  ...         College      Salary
237    Zaza Pachulia        Dallas Mavericks  ...             NaN   5200000.0
271    Zach Randolph       Memphis Grizzlies  ...  Michigan State   9638555.0
402      Zach LaVine  Minnesota Timberwolves  ...            UCLA   2148360.0
270   Xavier Munford       Memphis Grizzlies  ...    Rhode Island         NaN
386  Wilson Chandler          Denver Nuggets  ...          DePaul  10449438.0

[5 rows x 9 columns]

In [95]:
nba.sort_values("Age", ascending = False).head()

               Name                    Team  ...         College     Salary
304    Andre Miller       San Antonio Spurs  ...            Utah   250750.0
400   Kevin Garnett  Minnesota Timberwolves  ...             NaN  8500000.0
298      Tim Duncan       San Antonio Spurs  ...     Wake Forest  5250000.0
261    Vince Carter       Memphis Grizzlies  ...  North Carolina  4088019.0
102  Pablo Prigioni    Los Angeles Clippers  ...             NaN   947726.0

[5 rows x 9 columns]

In [0]:
nba.sort_values("Salary", ascending = False, inplace = True)

In [97]:
nba.sort_values("Salary", ascending = False, na_position = "first").tail()

                       Name                  Team  ...           College    Salary
175            Jordan McRae   Cleveland Cavaliers  ...         Tennessee  111196.0
135           Alan Williams          Phoenix Suns  ...  UC Santa Barbara   83397.0
291         Orlando Johnson  New Orleans Pelicans  ...  UC Santa Barbara   55722.0
130            Phil Pressey          Phoenix Suns  ...          Missouri   55722.0
32   Thanasis Antetokounmpo       New York Knicks  ...               NaN   30888.0

[5 rows x 9 columns]

In [98]:
nba.sort_values("Salary", ascending = False, na_position = "first").head()

              Name                 Team  ...            College Salary
2     John Holland       Boston Celtics  ...  Boston University    NaN
46     Elton Brand   Philadelphia 76ers  ...               Duke    NaN
171  Dahntay Jones  Cleveland Cavaliers  ...               Duke    NaN
264  Jordan Farmar    Memphis Grizzlies  ...               UCLA    NaN
269   Ray McCallum    Memphis Grizzlies  ...            Detroit    NaN

[5 rows x 9 columns]

In [100]:
nba.sort_values(["Team", "Name"], ascending = [True, False], inplace = True)
nba.head()

                 Name           Team  ...         College      Salary
322    Walter Tavares  Atlanta Hawks  ...             NaN   1000000.0
310  Tim Hardaway Jr.  Atlanta Hawks  ...        Michigan   1304520.0
321    Tiago Splitter  Atlanta Hawks  ...             NaN   9756250.0
320   Thabo Sefolosha  Atlanta Hawks  ...             NaN   4000000.0
315      Paul Millsap  Atlanta Hawks  ...  Louisiana Tech  18671659.0

[5 rows x 9 columns]

***The `.sort_index()` Method***

In [102]:
nba = pd.read_csv(path + "nba.csv").dropna(how='all')
nba.head(3)

            Name            Team  Number  ... Weight            College     Salary
0  Avery Bradley  Boston Celtics     0.0  ...  180.0              Texas  7730337.0
1    Jae Crowder  Boston Celtics    99.0  ...  235.0          Marquette  6796117.0
2   John Holland  Boston Celtics    30.0  ...  205.0  Boston University        NaN

[3 rows x 9 columns]

In [103]:
nba.sort_values(["Number", "Salary", "Name"], inplace = True)
nba.tail(3)

              Name             Team  Number  ... Weight    College      Salary
5     Amir Johnson   Boston Celtics    90.0  ...  240.0        NaN  12000000.0
68  Lucas Nogueira  Toronto Raptors    92.0  ...  220.0        NaN   1842000.0
1      Jae Crowder   Boston Celtics    99.0  ...  235.0  Marquette   6796117.0

[3 rows x 9 columns]

In [0]:
nba.sort_index(ascending = False, inplace = True)

In [106]:
nba.head(5)

             Name       Team  Number  ... Weight   College     Salary
456   Jeff Withey  Utah Jazz    24.0  ...  231.0    Kansas   947276.0
455  Tibor Pleiss  Utah Jazz    21.0  ...  256.0       NaN  2900000.0
454     Raul Neto  Utah Jazz    25.0  ...  179.0       NaN   900000.0
453  Shelvin Mack  Utah Jazz     8.0  ...  203.0    Butler  2433333.0
452    Trey Lyles  Utah Jazz    41.0  ...  234.0  Kentucky  2239800.0

[5 rows x 9 columns]

In [0]:
nba.sort_index(inplace = True)

In [108]:
nba.head()

            Name            Team  Number  ... Weight            College     Salary
0  Avery Bradley  Boston Celtics     0.0  ...  180.0              Texas  7730337.0
1    Jae Crowder  Boston Celtics    99.0  ...  235.0          Marquette  6796117.0
2   John Holland  Boston Celtics    30.0  ...  205.0  Boston University        NaN
3    R.J. Hunter  Boston Celtics    28.0  ...  185.0      Georgia State  1148640.0
4  Jonas Jerebko  Boston Celtics     8.0  ...  231.0                NaN  5000000.0

[5 rows x 9 columns]

***The `.rank()` Method***

In [0]:
nba = pd.read_csv(path + "nba.csv").dropna(how = "all")
nba["Salary"] = nba["Salary"].fillna(0).astype("int")

In [111]:
nba["Salary"].rank(ascending = False).astype("int")

0       97
1      110
2      452
3      322
4      147
      ...
452    250
453    241
454    383
455    214
456    367
Name: Salary, Length: 457, dtype: int64

In [0]:
nba["Salary Rank"] = nba["Salary"].rank(ascending = False).astype("int")

In [114]:
nba.head()

            Name            Team  ...   Salary Salary Rank
0  Avery Bradley  Boston Celtics  ...  7730337          97
1    Jae Crowder  Boston Celtics  ...  6796117         110
2   John Holland  Boston Celtics  ...        0         452
3    R.J. Hunter  Boston Celtics  ...  1148640         322
4  Jonas Jerebko  Boston Celtics  ...  5000000         147

[5 rows x 10 columns]

In [116]:
nba.sort_values(by = "Salary", ascending = False).head()

                Name                 Team  ...    Salary Salary Rank
109      Kobe Bryant   Los Angeles Lakers  ...  25000000           1
169     LeBron James  Cleveland Cavaliers  ...  22970500           2
33   Carmelo Anthony      New York Knicks  ...  22875000           3
251    Dwight Howard      Houston Rockets  ...  22359364           4
339       Chris Bosh           Miami Heat  ...  22192730           5

[5 rows x 10 columns]

In [0]:
df=pd.read_csv(path + "employees.csv")
df['Gender']=df['Gender'].astype('category')
df['Senior Management']=df['Senior Management'].astype('bool')
df['Start Date']=pd.to_datetime(df['Start Date'])
df['Last Login Time']=pd.to_datetime(df['Last Login Time'])

In [134]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    category
 2   Start Date         1000 non-null   datetime64[ns]
 3   Last Login Time    1000 non-null   datetime64[ns]
 4   Salary             1000 non-null   int64
 5   Bonus %            1000 non-null   float64
 6   Senior Management  933 non-null    category
 7   Team               957 non-null    object
dtypes: category(2), datetime64[ns](2), float64(1), int64(1), object(2)
memory usage: 49.1+ KB

In [0]:
#df['Gender']=df['Gender'].astype('category')
#df['Senior Management']=df['Senior Management'].astype('bool')
#df['Start Date']=pd.to_datetime(df['Start Date'])

***`Filter A DataFrame` Based `On A Condition`***

In [137]:
df = pd.read_csv(path + "employees.csv", parse_dates = ["Start Date", "Last Login Time"])
df["Senior Management"] = df["Senior Management"].astype("bool")
df["Gender"] = df["Gender"].astype("category")
df.head()

  First Name  Gender Start Date  ... Bonus %  Senior Management             Team
0    Douglas    Male 1993-08-06  ...   6.945               True        Marketing
1     Thomas    Male 1996-03-31  ...   4.170               True              NaN
2      Maria  Female 1993-04-23  ...  11.858              False          Finance
3      Jerry    Male 2005-03-04  ...   9.340               True          Finance
4      Larry    Male 1998-01-24  ...   1.389               True  Client Services

[5 rows x 8 columns]

In [138]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    category
 2   Start Date         1000 non-null   datetime64[ns]
 3   Last Login Time    1000 non-null   datetime64[ns]
 4   Salary             1000 non-null   int64
 5   Bonus %            1000 non-null   float64
 6   Senior Management  1000 non-null   bool
 7   Team               957 non-null    object
dtypes: bool(1), category(1), datetime64[ns](2), float64(1), int64(1), object(2)
memory usage: 49.0+ KB

In [142]:
df["Gender"]=="Male"

0       True
1       True
2      False
3       True
4       True
       ...
995    False
996     True
997     True
998     True
999     True
Name: Gender, Length: 1000, dtype: bool

In [143]:
df[df["Gender"]=="Male"].head()

  First Name Gender Start Date  ... Bonus %  Senior Management             Team
0    Douglas   Male 1993-08-06  ...   6.945               True        Marketing
1     Thomas   Male 1996-03-31  ...   4.170               True              NaN
3      Jerry   Male 2005-03-04  ...   9.340               True          Finance
4      Larry   Male 1998-01-24  ...   1.389               True  Client Services
5     Dennis   Male 1987-04-18  ...  10.125              False            Legal

[5 rows x 8 columns]

In [144]:
mask=df["Gender"]=="Male"
df[mask].head()

  First Name Gender Start Date  ... Bonus %  Senior Management             Team
0    Douglas   Male 1993-08-06  ...   6.945               True        Marketing
1     Thomas   Male 1996-03-31  ...   4.170               True              NaN
3      Jerry   Male 2005-03-04  ...   9.340               True          Finance
4      Larry   Male 1998-01-24  ...   1.389               True  Client Services
5     Dennis   Male 1987-04-18  ...  10.125              False            Legal

[5 rows x 8 columns]

In [146]:
df["Team"]!="Marketing"

0      False
1       True
2       True
3       True
4       True
       ...
995     True
996     True
997     True
998     True
999     True
Name: Team, Length: 1000, dtype: bool

In [147]:
df[df["Team"]!="Marketing"].head()

  First Name  Gender Start Date  ... Bonus %  Senior Management             Team
1     Thomas    Male 1996-03-31  ...   4.170               True              NaN
2      Maria  Female 1993-04-23  ...  11.858              False          Finance
3      Jerry    Male 2005-03-04  ...   9.340               True          Finance
4      Larry    Male 1998-01-24  ...   1.389               True  Client Services
5     Dennis    Male 1987-04-18  ...  10.125              False            Legal

[5 rows x 8 columns]

In [149]:
mask=df["Team"]!="Marketing"
df[mask].head()

  First Name  Gender Start Date  ... Bonus %  Senior Management             Team
1     Thomas    Male 1996-03-31  ...   4.170               True              NaN
2      Maria  Female 1993-04-23  ...  11.858              False          Finance
3      Jerry    Male 2005-03-04  ...   9.340               True          Finance
4      Larry    Male 1998-01-24  ...   1.389               True  Client Services
5     Dennis    Male 1987-04-18  ...  10.125              False            Legal

[5 rows x 8 columns]

In [151]:
mask=df["Start Date"]<="1985-01-01" # After coverting into datetime we can do so but not when it was in string type.
df[mask].head()

   First Name  Gender Start Date  ... Bonus %  Senior Management             Team
10     Louise  Female 1980-08-12  ...  15.132               True              NaN
12    Brandon    Male 1980-12-01  ...  17.492               True  Human Resources
18      Diana  Female 1981-10-23  ...  19.082              False  Client Services
28      Terry    Male 1981-11-27  ...  13.464               True  Client Services
37      Linda  Female 1981-10-19  ...   9.557               True  Client Services

[5 rows x 8 columns]

In [153]:
mask1 = df["Gender"] == "Male"
mask2 = df["Team"] == "Marketing"
df[mask1 & mask2].head()

   First Name Gender Start Date  ... Bonus %  Senior Management       Team
0     Douglas   Male 1993-08-06  ...   6.945               True  Marketing
21    Matthew   Male 1995-09-05  ...  13.645              False  Marketing
26      Craig   Male 2000-02-27  ...   7.757               True  Marketing
74     Thomas   Male 1995-06-04  ...  17.029              False  Marketing
77    Charles   Male 2004-09-14  ...   1.260               True  Marketing

[5 rows x 8 columns]

In [154]:
mask1 = df["Senior Management"]
mask2 = df["Start Date"] < "1990-01-01"
df[mask1 | mask2].head()

  First Name Gender Start Date  ... Bonus %  Senior Management             Team
0    Douglas   Male 1993-08-06  ...   6.945               True        Marketing
1     Thomas   Male 1996-03-31  ...   4.170               True              NaN
3      Jerry   Male 2005-03-04  ...   9.340               True          Finance
4      Larry   Male 1998-01-24  ...   1.389               True  Client Services
5     Dennis   Male 1987-04-18  ...  10.125              False            Legal

[5 rows x 8 columns]

In [155]:
mask1 = df["First Name"] == "Robert"
mask2 = df["Team"] == "Client Services"
mask3 = df["Start Date"] > "2016-06-01"
df[(mask1 & mask2) | mask3]

    First Name  Gender Start Date  ... Bonus %  Senior Management             Team
15     Lillian  Female 2016-06-05  ...   1.256              False          Product
98        Tina  Female 2016-06-16  ...  16.961               True        Marketing
387     Robert    Male 1994-10-29  ...  19.894              False  Client Services
451      Terry     NaN 2016-07-15  ...  19.490               True        Marketing

[4 rows x 8 columns]

***The `.isin()` Method***

In [157]:
mask1 = df["Team"] == "Legal"
mask2 = df["Team"] == "Sales"
mask3 = df["Team"] == "Product"
df[mask1 | mask2 | mask3].head()

   First Name  Gender Start Date  ... Bonus %  Senior Management     Team
5      Dennis    Male 1987-04-18  ...  10.125              False    Legal
6        Ruby  Female 1987-08-17  ...  10.012               True  Product
11      Julie  Female 1997-10-26  ...  12.637               True    Legal
13       Gary    Male 2008-01-27  ...   5.831              False    Sales
15    Lillian  Female 2016-06-05  ...   1.256              False  Product

[5 rows x 8 columns]

In [159]:
mask=df["Team"].isin(["Legal","Sales","Product","Marketing"])
df[mask].head()

   First Name  Gender Start Date  ... Bonus %  Senior Management       Team
0     Douglas    Male 1993-08-06  ...   6.945               True  Marketing
5      Dennis    Male 1987-04-18  ...  10.125              False      Legal
6        Ruby  Female 1987-08-17  ...  10.012               True    Product
11      Julie  Female 1997-10-26  ...  12.637               True      Legal
13       Gary    Male 2008-01-27  ...   5.831              False      Sales

[5 rows x 8 columns]

***The `.isnull()` and `.notnull()` Methods***

In [162]:
 df["Team"].isnull()

0      False
1       True
2      False
3      False
4      False
       ...
995    False
996    False
997    False
998    False
999    False
Name: Team, Length: 1000, dtype: bool

In [164]:
mask = df["Team"].isnull()
df[mask].head()

   First Name  Gender Start Date  ... Bonus %  Senior Management  Team
1      Thomas    Male 1996-03-31  ...   4.170               True   NaN
10     Louise  Female 1980-08-12  ...  15.132               True   NaN
23        NaN    Male 2012-06-14  ...   5.042               True   NaN
32        NaN    Male 1998-08-21  ...   6.417               True   NaN
91      James     NaN 2005-01-26  ...   8.309              False   NaN

[5 rows x 8 columns]

In [165]:
mask = df["Team"].notnull()
df[mask].head()

  First Name  Gender Start Date  ... Bonus %  Senior Management             Team
0    Douglas    Male 1993-08-06  ...   6.945               True        Marketing
2      Maria  Female 1993-04-23  ...  11.858              False          Finance
3      Jerry    Male 2005-03-04  ...   9.340               True          Finance
4      Larry    Male 1998-01-24  ...   1.389               True  Client Services
5     Dennis    Male 1987-04-18  ...  10.125              False            Legal

[5 rows x 8 columns]

***The `.between()` Method***

In [167]:
df[df["Salary"].between(60000, 70000)].head()

   First Name  Gender  ... Senior Management                  Team
1      Thomas    Male  ...              True                   NaN
6        Ruby  Female  ...              True               Product
10     Louise  Female  ...              True                   NaN
20       Lois     NaN  ...              True                 Legal
41  Christine     NaN  ...              True  Business Development

[5 rows x 8 columns]

In [168]:
df[df["Bonus %"].between(2.0, 5.0)].head()

   First Name Gender Start Date  ... Bonus %  Senior Management          Team
1      Thomas   Male 1996-03-31  ...   4.170               True           NaN
20       Lois    NaN 1995-04-22  ...   4.934               True         Legal
40    Michael   Male 2008-10-10  ...   2.665               True  Distribution
49      Chris    NaN 1980-01-24  ...   3.055              False         Sales
60      Paula    NaN 2005-11-23  ...   4.271              False  Distribution

[5 rows x 8 columns]

In [172]:
df[df["Start Date"].between("1991-01-01", "1992-01-01")].head()

    First Name  Gender Start Date  ... Bonus %  Senior Management             Team
27       Scott     NaN 1991-07-11  ...   5.218              False            Legal
75      Bonnie  Female 1991-07-02  ...   5.118               True  Human Resources
88       Donna  Female 1991-11-27  ...   6.155               True            Legal
116        NaN    Male 1991-06-22  ...  18.988               True            Legal
148    Patrick     NaN 1991-07-14  ...  14.837               True            Sales

[5 rows x 8 columns]

In [171]:
df[df["Last Login Time"].between("08:30AM", "12:00PM")].head()

   First Name  Gender  ... Senior Management                  Team
2       Maria  Female  ...             False               Finance
7         NaN  Female  ...              True               Finance
10     Louise  Female  ...              True                   NaN
18      Diana  Female  ...             False       Client Services
33       Jean  Female  ...             False  Business Development

[5 rows x 8 columns]

***The `.duplicated()` Method***

In [173]:
df = pd.read_csv(path + "employees.csv", parse_dates = ["Start Date", "Last Login Time"])
df["Senior Management"] = df["Senior Management"].astype("bool")
df["Gender"] = df["Gender"].astype("category")
df.sort_values("First Name", inplace = True)
df

    First Name  Gender Start Date  ... Bonus %  Senior Management             Team
101      Aaron    Male 2012-02-17  ...  11.849               True        Marketing
327      Aaron    Male 1994-01-29  ...   5.097               True        Marketing
440      Aaron    Male 1990-07-22  ...  11.343               True  Client Services
937      Aaron     NaN 1986-01-22  ...  18.424              False  Client Services
137       Adam    Male 2011-05-21  ...  15.120              False     Distribution
..         ...     ...        ...  ...     ...                ...              ...
902        NaN    Male 2001-05-23  ...   6.322               True     Distribution
925        NaN  Female 2000-08-23  ...  19.388               True            Sales
946        NaN  Female 1985-09-15  ...  16.941               True     Distribution
947        NaN    Male 2012-07-30  ...   5.329               True        Marketing
951        NaN  Female 2010-09-14  ...   9.662               True              NaN

[1000 rows x 8 columns]

In [179]:
df["First Name"].value_counts()

Marilyn    11
Jeremy     10
Todd       10
Barbara    10
Kathy       9
           ..
Dennis      1
Jean        1
Keith       1
Eugene      1
Angela      1
Name: First Name, Length: 200, dtype: int64

In [185]:
df["First Name"].duplicated(keep = False) #Only duplicate i.e 1,1,2,3 - 1,1

101    True
327    True
440    True
937    True
137    True
       ...
902    True
925    True
946    True
947    True
951    True
Name: First Name, Length: 1000, dtype: bool

In [189]:
df[df["First Name"].duplicated(keep = False)]

    First Name  Gender Start Date  ... Bonus %  Senior Management             Team
101      Aaron    Male 2012-02-17  ...  11.849               True        Marketing
327      Aaron    Male 1994-01-29  ...   5.097               True        Marketing
440      Aaron    Male 1990-07-22  ...  11.343               True  Client Services
937      Aaron     NaN 1986-01-22  ...  18.424              False  Client Services
137       Adam    Male 2011-05-21  ...  15.120              False     Distribution
..         ...     ...        ...  ...     ...                ...              ...
902        NaN    Male 2001-05-23  ...   6.322               True     Distribution
925        NaN  Female 2000-08-23  ...  19.388               True            Sales
946        NaN  Female 1985-09-15  ...  16.941               True     Distribution
947        NaN    Male 2012-07-30  ...   5.329               True        Marketing
951        NaN  Female 2010-09-14  ...   9.662               True              NaN

[991 rows x 8 columns]

In [190]:
df[df["First Name"].duplicated(keep = False)]['First Name'].value_counts()

Marilyn    11
Todd       10
Barbara    10
Jeremy     10
Sarah       9
           ..
Heather     2
Dorothy     2
Chris       2
Wanda       2
Mildred     2
Name: First Name, Length: 191, dtype: int64

In [191]:
~df["First Name"].duplicated(keep = False) # Means i don't need duplicate rows  i.e 1,1,2,3 then 2,3

101    False
327    False
440    False
937    False
137    False
       ...
902    False
925    False
946    False
947    False
951    False
Name: First Name, Length: 1000, dtype: bool

In [192]:
df[~df["First Name"].duplicated(keep = False)] # Rows which are appeared only once.

    First Name  Gender  ... Senior Management                  Team
8       Angela  Female  ...              True           Engineering
688      Brian    Male  ...              True                 Legal
190      Carol  Female  ...             False               Finance
887      David    Male  ...             False                 Legal
5       Dennis    Male  ...             False                 Legal
495     Eugene    Male  ...             False                 Sales
33        Jean  Female  ...             False  Business Development
832      Keith    Male  ...             False                 Legal
291      Tammy  Female  ...              True       Client Services

[9 rows x 8 columns]

In [193]:
df[~df["First Name"].duplicated(keep = False)]['First Name'].value_counts()

Dennis    1
Eugene    1
David     1
Angela    1
Jean      1
Tammy     1
Carol     1
Keith     1
Brian     1
Name: First Name, dtype: int64

In [194]:
# Keep first row  if "First Name" is duplicated  # 1(this),1,1,2(this),3(this),5(this),5  - 1,2,3,5
mask = ~df["First Name"].duplicated(keep ='first')
df[mask]

    First Name  Gender Start Date  ... Bonus %  Senior Management             Team
101      Aaron    Male 2012-02-17  ...  11.849               True        Marketing
137       Adam    Male 2011-05-21  ...  15.120              False     Distribution
300       Alan    Male 1988-06-26  ...   3.592               True      Engineering
372     Albert    Male 1997-02-01  ...  19.717               True      Engineering
988      Alice  Female 2004-10-05  ...  11.209              False  Human Resources
..         ...     ...        ...  ...     ...                ...              ...
433      Wanda  Female 2008-07-20  ...   7.132               True            Legal
177      Wayne    Male 2012-04-07  ...  14.085               True     Distribution
820    William    Male 1993-11-18  ...   5.182               True  Human Resources
450     Willie    Male 2009-08-22  ...  19.691              False            Legal
7          NaN  Female 2015-07-20  ...  11.598               True          Finance

[201 rows x 8 columns]

In [195]:
# Keep last row if "First Name" is duplicated  i.e 1,1,1(this),2(this),3(this),5,5(this) - 1,2,3,5
mask = ~df["First Name"].duplicated(keep ='last')
df[mask]

    First Name  Gender  ... Senior Management                  Team
937      Aaron     NaN  ...             False       Client Services
538       Adam    Male  ...             False       Human Resources
610       Alan    Male  ...             False               Product
959     Albert    Male  ...              True  Business Development
693      Alice  Female  ...             False                 Sales
..         ...     ...  ...               ...                   ...
512      Wanda  Female  ...             False                   NaN
637      Wayne    Male  ...             False       Human Resources
127    William    Male  ...             False       Human Resources
652     Willie    Male  ...              True           Engineering
951        NaN  Female  ...              True                   NaN

[201 rows x 8 columns]

In [196]:
# Keep only those rows in which "First Name" is not duplicated (or "First Name" is only once)
mask = ~df["First Name"].duplicated(keep =False)
df[mask]

    First Name  Gender  ... Senior Management                  Team
8       Angela  Female  ...              True           Engineering
688      Brian    Male  ...              True                 Legal
190      Carol  Female  ...             False               Finance
887      David    Male  ...             False                 Legal
5       Dennis    Male  ...             False                 Legal
495     Eugene    Male  ...             False                 Sales
33        Jean  Female  ...             False  Business Development
832      Keith    Male  ...             False                 Legal
291      Tammy  Female  ...              True       Client Services

[9 rows x 8 columns]

***The `.drop_duplicates()` Method***

In [197]:
df = pd.read_csv(path + "employees.csv", parse_dates = ["Start Date", "Last Login Time"])
df["Senior Management"] = df["Senior Management"].astype("bool")
df["Gender"] = df["Gender"].astype("category")
df.sort_values("First Name", inplace = True)
df.head(3)

    First Name Gender Start Date  ... Bonus %  Senior Management             Team
101      Aaron   Male 2012-02-17  ...  11.849               True        Marketing
327      Aaron   Male 1994-01-29  ...   5.097               True        Marketing
440      Aaron   Male 1990-07-22  ...  11.343               True  Client Services

[3 rows x 8 columns]

In [198]:
len(df)

1000

In [199]:
len(df.drop_duplicates())

1000

In [200]:
df.drop_duplicates(subset = ["First Name"], keep = False) # It will remove all duplicate.

    First Name  Gender  ... Senior Management                  Team
8       Angela  Female  ...              True           Engineering
688      Brian    Male  ...              True                 Legal
190      Carol  Female  ...             False               Finance
887      David    Male  ...             False                 Legal
5       Dennis    Male  ...             False                 Legal
495     Eugene    Male  ...             False                 Sales
33        Jean  Female  ...             False  Business Development
832      Keith    Male  ...             False                 Legal
291      Tammy  Female  ...              True       Client Services

[9 rows x 8 columns]

In [205]:
df.drop_duplicates(subset = ["First Name"], keep = 'first')

    First Name  Gender Start Date  ... Bonus %  Senior Management             Team
101      Aaron    Male 2012-02-17  ...  11.849               True        Marketing
137       Adam    Male 2011-05-21  ...  15.120              False     Distribution
300       Alan    Male 1988-06-26  ...   3.592               True      Engineering
372     Albert    Male 1997-02-01  ...  19.717               True      Engineering
988      Alice  Female 2004-10-05  ...  11.209              False  Human Resources
..         ...     ...        ...  ...     ...                ...              ...
433      Wanda  Female 2008-07-20  ...   7.132               True            Legal
177      Wayne    Male 2012-04-07  ...  14.085               True     Distribution
820    William    Male 1993-11-18  ...   5.182               True  Human Resources
450     Willie    Male 2009-08-22  ...  19.691              False            Legal
7          NaN  Female 2015-07-20  ...  11.598               True          Finance

[201 rows x 8 columns]

In [206]:
df.drop_duplicates(subset = ["First Name"], keep = 'last')

    First Name  Gender  ... Senior Management                  Team
937      Aaron     NaN  ...             False       Client Services
538       Adam    Male  ...             False       Human Resources
610       Alan    Male  ...             False               Product
959     Albert    Male  ...              True  Business Development
693      Alice  Female  ...             False                 Sales
..         ...     ...  ...               ...                   ...
512      Wanda  Female  ...             False                   NaN
637      Wayne    Male  ...             False       Human Resources
127    William    Male  ...             False       Human Resources
652     Willie    Male  ...              True           Engineering
951        NaN  Female  ...              True                   NaN

[201 rows x 8 columns]

***The `.unique()` and `.nunique()` Methods***

In [207]:
df = pd.read_csv(path + "employees.csv", parse_dates = ["Start Date", "Last Login Time"])
df["Senior Management"] = df["Senior Management"].astype("bool")
df["Gender"] = df["Gender"].astype("category")
df["Team"] = df["Team"].astype("category")
df.head()

  First Name  Gender Start Date  ... Bonus %  Senior Management             Team
0    Douglas    Male 1993-08-06  ...   6.945               True        Marketing
1     Thomas    Male 1996-03-31  ...   4.170               True              NaN
2      Maria  Female 1993-04-23  ...  11.858              False          Finance
3      Jerry    Male 2005-03-04  ...   9.340               True          Finance
4      Larry    Male 1998-01-24  ...   1.389               True  Client Services

[5 rows x 8 columns]

In [209]:
print(df["Gender"].unique())
print(df["Team"].unique())

[Male, Female, NaN]
Categories (2, object): [Male, Female]
[Marketing, NaN, Finance, Client Services, Legal, ..., Engineering, Business Development, Human Resources, Sales, Distribution]
Length: 11
Categories (10, object): [Marketing, Finance, Client Services, Legal, ..., Business Development,
                          Human Resources, Sales, Distribution]

In [220]:
print(len(df["Gender"].unique()))
print(df["Gender"].nunique()) # It will not count NaN
print(df["Gender"].nunique(dropna=False))

3
2
3

In [221]:
print(len(df["Team"].unique()))
print(df["Team"].nunique()) # It will not count NaN
print(df["Team"].nunique(dropna=False))

11
10
11

***The `.set_index()` and `.reset_index()` Methods***

In [230]:
bond = pd.read_csv(path + "jamesbond.csv")
bond.head()

                    Film  Year  ... Budget Bond Actor Salary
0                 Dr. No  1962  ...    7.0               0.6
1  From Russia with Love  1963  ...   12.6               1.6
2             Goldfinger  1964  ...   18.6               3.2
3            Thunderball  1965  ...   41.9               4.7
4          Casino Royale  1967  ...   85.0               NaN

[5 rows x 7 columns]

In [231]:
bond.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26 entries, 0 to 25
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Film               26 non-null     object
 1   Year               26 non-null     int64
 2   Actor              26 non-null     object
 3   Director           26 non-null     object
 4   Box Office         26 non-null     float64
 5   Budget             26 non-null     float64
 6   Bond Actor Salary  18 non-null     float64
dtypes: float64(3), int64(1), object(3)
memory usage: 1.5+ KB

In [232]:
bond.set_index("Film", inplace = True)
bond.head()

                       Year         Actor  ... Budget  Bond Actor Salary
Film                                       ...
Dr. No                 1962  Sean Connery  ...    7.0                0.6
From Russia with Love  1963  Sean Connery  ...   12.6                1.6
Goldfinger             1964  Sean Connery  ...   18.6                3.2
Thunderball            1965  Sean Connery  ...   41.9                4.7
Casino Royale          1967   David Niven  ...   85.0                NaN

[5 rows x 6 columns]

In [233]:
bond.reset_index().head()

                    Film  Year  ... Budget Bond Actor Salary
0                 Dr. No  1962  ...    7.0               0.6
1  From Russia with Love  1963  ...   12.6               1.6
2             Goldfinger  1964  ...   18.6               3.2
3            Thunderball  1965  ...   41.9               4.7
4          Casino Royale  1967  ...   85.0               NaN

[5 rows x 7 columns]

In [234]:
bond.reset_index(drop=True).head()

   Year         Actor       Director  Box Office  Budget  Bond Actor Salary
0  1962  Sean Connery  Terence Young       448.8     7.0                0.6
1  1963  Sean Connery  Terence Young       543.8    12.6                1.6
2  1964  Sean Connery   Guy Hamilton       820.4    18.6                3.2
3  1965  Sean Connery  Terence Young       848.1    41.9                4.7
4  1967   David Niven     Ken Hughes       315.0    85.0                NaN

In [235]:
bond.reset_index(drop = False, inplace = True)
bond.head()

                    Film  Year  ... Budget Bond Actor Salary
0                 Dr. No  1962  ...    7.0               0.6
1  From Russia with Love  1963  ...   12.6               1.6
2             Goldfinger  1964  ...   18.6               3.2
3            Thunderball  1965  ...   41.9               4.7
4          Casino Royale  1967  ...   85.0               NaN

[5 rows x 7 columns]

In [236]:
bond.set_index("Film", inplace = True)
bond.head()

                       Year         Actor  ... Budget  Bond Actor Salary
Film                                       ...
Dr. No                 1962  Sean Connery  ...    7.0                0.6
From Russia with Love  1963  Sean Connery  ...   12.6                1.6
Goldfinger             1964  Sean Connery  ...   18.6                3.2
Thunderball            1965  Sean Connery  ...   41.9                4.7
Casino Royale          1967   David Niven  ...   85.0                NaN

[5 rows x 6 columns]

In [237]:
bond.reset_index(inplace = True)
bond.set_index("Year", inplace = True)
bond.head()

                       Film         Actor  ... Budget  Bond Actor Salary
Year                                       ...
1962                 Dr. No  Sean Connery  ...    7.0                0.6
1963  From Russia with Love  Sean Connery  ...   12.6                1.6
1964             Goldfinger  Sean Connery  ...   18.6                3.2
1965            Thunderball  Sean Connery  ...   41.9                4.7
1967          Casino Royale   David Niven  ...   85.0                NaN

[5 rows x 6 columns]

In [0]:
bond.reset_index(inplace = True)

In [239]:
bond.head()

   Year                   Film  ... Budget Bond Actor Salary
0  1962                 Dr. No  ...    7.0               0.6
1  1963  From Russia with Love  ...   12.6               1.6
2  1964             Goldfinger  ...   18.6               3.2
3  1965            Thunderball  ...   41.9               4.7
4  1967          Casino Royale  ...   85.0               NaN

[5 rows x 7 columns]

***`Retrieve Row(s)` by `Index Label` with `.loc[]`***

In [240]:
bond = pd.read_csv(path + "jamesbond.csv", index_col = "Film")
bond.sort_index(inplace = True) # We sort by index to access faster/retrival faster.(Best Practise)
bond.head()

                      Year           Actor  ... Budget  Bond Actor Salary
Film                                        ...
A View to a Kill      1985     Roger Moore  ...   54.5                9.1
Casino Royale         2006    Daniel Craig  ...  145.3                3.3
Casino Royale         1967     David Niven  ...   85.0                NaN
Diamonds Are Forever  1971    Sean Connery  ...   34.7                5.8
Die Another Day       2002  Pierce Brosnan  ...  154.2               17.9

[5 rows x 6 columns]

In [241]:
bond.loc["Goldfinger"]

Year                         1964
Actor                Sean Connery
Director             Guy Hamilton
Box Office                  820.4
Budget                       18.6
Bond Actor Salary             3.2
Name: Goldfinger, dtype: object

In [242]:
bond.loc["GoldenEye"]

Year                            1995
Actor                 Pierce Brosnan
Director             Martin Campbell
Box Office                     518.5
Budget                          76.9
Bond Actor Salary                5.1
Name: GoldenEye, dtype: object

In [243]:
bond.loc["Casino Royale"]

               Year         Actor  ... Budget  Bond Actor Salary
Film                               ...
Casino Royale  2006  Daniel Craig  ...  145.3                3.3
Casino Royale  1967   David Niven  ...   85.0                NaN

[2 rows x 6 columns]

In [244]:
bond.loc["Diamonds Are Forever" : "Moonraker"]

                       Year           Actor  ... Budget  Bond Actor Salary
Film                                         ...
Diamonds Are Forever   1971    Sean Connery  ...   34.7                5.8
Die Another Day        2002  Pierce Brosnan  ...  154.2               17.9
Dr. No                 1962    Sean Connery  ...    7.0                0.6
For Your Eyes Only     1981     Roger Moore  ...   60.2                NaN
From Russia with Love  1963    Sean Connery  ...   12.6                1.6
GoldenEye              1995  Pierce Brosnan  ...   76.9                5.1
Goldfinger             1964    Sean Connery  ...   18.6                3.2
Licence to Kill        1989  Timothy Dalton  ...   56.7                7.9
Live and Let Die       1973     Roger Moore  ...   30.8                NaN
Moonraker              1979     Roger Moore  ...   91.5                NaN

[10 rows x 6 columns]

In [245]:
bond.loc[: "On Her Majesty's Secret Service"]

                                 Year  ... Bond Actor Salary
Film                                   ...
A View to a Kill                 1985  ...               9.1
Casino Royale                    2006  ...               3.3
Casino Royale                    1967  ...               NaN
Diamonds Are Forever             1971  ...               5.8
Die Another Day                  2002  ...              17.9
Dr. No                           1962  ...               0.6
For Your Eyes Only               1981  ...               NaN
From Russia with Love            1963  ...               1.6
GoldenEye                        1995  ...               5.1
Goldfinger                       1964  ...               3.2
Licence to Kill                  1989  ...               7.9
Live and Let Die                 1973  ...               NaN
Moonraker                        1979  ...               NaN
Never Say Never Again            1983  ...               NaN
Octopussy                        1983  ...               7.8
On Her Majesty's Secret Service  1969  ...               0.6

[16 rows x 6 columns]

In [246]:
bond.loc[["Octopussy", "Moonraker"]]

           Year        Actor  ... Budget  Bond Actor Salary
Film                          ...
Octopussy  1983  Roger Moore  ...   53.9                7.8
Moonraker  1979  Roger Moore  ...   91.5                NaN

[2 rows x 6 columns]

In [249]:
bond.loc[["For Your Eyes Only", "Live and Let Die", "Gold Bond"]]  # "Gold Bond" is not found so key error

KeyError: ignored

In [250]:
"Gold Bond" in bond.index

False

***`Retrieve Row(s)` by `Index Position` with `iloc[]`***

In [251]:
bond = pd.read_csv(path + "jamesbond.csv")
bond.head()

                    Film  Year  ... Budget Bond Actor Salary
0                 Dr. No  1962  ...    7.0               0.6
1  From Russia with Love  1963  ...   12.6               1.6
2             Goldfinger  1964  ...   18.6               3.2
3            Thunderball  1965  ...   41.9               4.7
4          Casino Royale  1967  ...   85.0               NaN

[5 rows x 7 columns]

In [252]:
bond.loc[15]

Film                 A View to a Kill
Year                             1985
Actor                     Roger Moore
Director                    John Glen
Box Office                      275.2
Budget                           54.5
Bond Actor Salary                 9.1
Name: 15, dtype: object

In [253]:
bond.iloc[15]

Film                 A View to a Kill
Year                             1985
Actor                     Roger Moore
Director                    John Glen
Box Office                      275.2
Budget                           54.5
Bond Actor Salary                 9.1
Name: 15, dtype: object

In [254]:
bond.iloc[[15, 20]]

                       Film  Year  ... Budget Bond Actor Salary
15         A View to a Kill  1985  ...   54.5               9.1
20  The World Is Not Enough  1999  ...  158.3              13.5

[2 rows x 7 columns]

In [255]:
bond.iloc[:4]

                    Film  Year  ... Budget Bond Actor Salary
0                 Dr. No  1962  ...    7.0               0.6
1  From Russia with Love  1963  ...   12.6               1.6
2             Goldfinger  1964  ...   18.6               3.2
3            Thunderball  1965  ...   41.9               4.7

[4 rows x 7 columns]

In [256]:
bond.iloc[4:8]

                              Film  Year  ... Budget Bond Actor Salary
4                    Casino Royale  1967  ...   85.0               NaN
5              You Only Live Twice  1967  ...   59.9               4.4
6  On Her Majesty's Secret Service  1969  ...   37.3               0.6
7             Diamonds Are Forever  1971  ...   34.7               5.8

[4 rows x 7 columns]

In [257]:
bond.iloc[20:]

                       Film  Year  ... Budget Bond Actor Salary
20  The World Is Not Enough  1999  ...  158.3              13.5
21          Die Another Day  2002  ...  154.2              17.9
22            Casino Royale  2006  ...  145.3               3.3
23        Quantum of Solace  2008  ...  181.4               8.1
24                  Skyfall  2012  ...  170.2              14.5
25                  Spectre  2015  ...  206.3               NaN

[6 rows x 7 columns]

In [258]:
bond = pd.read_csv(path + "jamesbond.csv", index_col = "Film")
bond.sort_index(inplace = True)
bond.head()

                      Year           Actor  ... Budget  Bond Actor Salary
Film                                        ...
A View to a Kill      1985     Roger Moore  ...   54.5                9.1
Casino Royale         2006    Daniel Craig  ...  145.3                3.3
Casino Royale         1967     David Niven  ...   85.0                NaN
Diamonds Are Forever  1971    Sean Connery  ...   34.7                5.8
Die Another Day       2002  Pierce Brosnan  ...  154.2               17.9

[5 rows x 6 columns]

In [260]:
bond.iloc[[5, 10, 15, 20]]

                                 Year  ... Bond Actor Salary
Film                                   ...
Dr. No                           1962  ...               0.6
Licence to Kill                  1989  ...               7.9
On Her Majesty's Secret Service  1969  ...               0.6
The Man with the Golden Gun      1974  ...               NaN

[4 rows x 6 columns]

***`Second argument to `loc[ ]` and `iloc[ ]***

In [261]:
bond = pd.read_csv(path + "jamesbond.csv", index_col = "Film")
bond.sort_index(inplace = True)
bond.head()

                      Year           Actor  ... Budget  Bond Actor Salary
Film                                        ...
A View to a Kill      1985     Roger Moore  ...   54.5                9.1
Casino Royale         2006    Daniel Craig  ...  145.3                3.3
Casino Royale         1967     David Niven  ...   85.0                NaN
Diamonds Are Forever  1971    Sean Connery  ...   34.7                5.8
Die Another Day       2002  Pierce Brosnan  ...  154.2               17.9

[5 rows x 6 columns]

In [264]:
bond.loc["Moonraker", "Actor"]

'Roger Moore'

In [265]:
bond.loc["Moonraker", ["Actor", "Budget", "Year"]]

Actor     Roger Moore
Budget           91.5
Year             1979
Name: Moonraker, dtype: object

In [0]:
bond.iloc[14, [5, 3, 2]]

In [266]:
bond.iloc[14, 1:3]

Actor       Roger Moore
Director      John Glen
Name: Octopussy, dtype: object

In [267]:
bond.iloc[:5, 1:3]

                               Actor         Director
Film
A View to a Kill         Roger Moore        John Glen
Casino Royale           Daniel Craig  Martin Campbell
Casino Royale            David Niven       Ken Hughes
Diamonds Are Forever    Sean Connery     Guy Hamilton
Die Another Day       Pierce Brosnan     Lee Tamahori

***`Set New Values` for a `Specific Cell or Row`***

In [268]:
bond = pd.read_csv(path + "jamesbond.csv", index_col = "Film")
bond.sort_index(inplace = True)
bond.head()

                      Year           Actor  ... Budget  Bond Actor Salary
Film                                        ...
A View to a Kill      1985     Roger Moore  ...   54.5                9.1
Casino Royale         2006    Daniel Craig  ...  145.3                3.3
Casino Royale         1967     David Niven  ...   85.0                NaN
Diamonds Are Forever  1971    Sean Connery  ...   34.7                5.8
Die Another Day       2002  Pierce Brosnan  ...  154.2               17.9

[5 rows x 6 columns]

In [269]:
bond.loc["Dr. No"]

Year                          1962
Actor                 Sean Connery
Director             Terence Young
Box Office                   448.8
Budget                           7
Bond Actor Salary              0.6
Name: Dr. No, dtype: object

In [0]:
bond.loc["Dr. No", "Actor"] = "Sir Sean Connery"

In [273]:
bond.loc["Dr. No"]

Year                             1962
Actor                Sir Sean Connery
Director                Terence Young
Box Office                  4.488e+08
Budget                          7e+06
Bond Actor Salary              600000
Name: Dr. No, dtype: object

In [0]:
bond.loc["Dr. No", ["Box Office", "Budget", "Bond Actor Salary"]] = [448800000, 7000000, 600000]

In [276]:
bond.loc["Dr. No"]

Year                             1962
Actor                Sir Sean Connery
Director                Terence Young
Box Office                  4.488e+08
Budget                          7e+06
Bond Actor Salary              600000
Name: Dr. No, dtype: object

***`Set Multiple Values` in `DataFrame`***

In [283]:
bond = pd.read_csv(path + "jamesbond.csv", index_col = "Film")
bond.sort_index(inplace = True)
bond.head()

                      Year           Actor  ... Budget  Bond Actor Salary
Film                                        ...
A View to a Kill      1985     Roger Moore  ...   54.5                9.1
Casino Royale         2006    Daniel Craig  ...  145.3                3.3
Casino Royale         1967     David Niven  ...   85.0                NaN
Diamonds Are Forever  1971    Sean Connery  ...   34.7                5.8
Die Another Day       2002  Pierce Brosnan  ...  154.2               17.9

[5 rows x 6 columns]

In [0]:
mask = bond["Actor"] == "Sean Connery"

In [285]:
bond.loc[mask]
#bond[mask] both are correct

                       Year         Actor  ... Budget  Bond Actor Salary
Film                                       ...
Diamonds Are Forever   1971  Sean Connery  ...   34.7                5.8
Dr. No                 1962  Sean Connery  ...    7.0                0.6
From Russia with Love  1963  Sean Connery  ...   12.6                1.6
Goldfinger             1964  Sean Connery  ...   18.6                3.2
Never Say Never Again  1983  Sean Connery  ...   86.0                NaN
Thunderball            1965  Sean Connery  ...   41.9                4.7
You Only Live Twice    1967  Sean Connery  ...   59.9                4.4

[7 rows x 6 columns]

In [0]:
bond.loc[mask, "Actor"] = "Sir Sean Connery"

In [0]:
mask = bond["Actor"] == "Sir Sean Connery"

In [288]:
bond.loc[mask]
#bond[mask] both are correct

                       Year             Actor  ... Budget  Bond Actor Salary
Film                                           ...
Diamonds Are Forever   1971  Sir Sean Connery  ...   34.7                5.8
Dr. No                 1962  Sir Sean Connery  ...    7.0                0.6
From Russia with Love  1963  Sir Sean Connery  ...   12.6                1.6
Goldfinger             1964  Sir Sean Connery  ...   18.6                3.2
Never Say Never Again  1983  Sir Sean Connery  ...   86.0                NaN
Thunderball            1965  Sir Sean Connery  ...   41.9                4.7
You Only Live Twice    1967  Sir Sean Connery  ...   59.9                4.4

[7 rows x 6 columns]

***The `.rename()` Method***

In [289]:
bond = pd.read_csv(path + "jamesbond.csv", index_col = "Film")
bond.sort_index(inplace = True)
bond.head()

                      Year           Actor  ... Budget  Bond Actor Salary
Film                                        ...
A View to a Kill      1985     Roger Moore  ...   54.5                9.1
Casino Royale         2006    Daniel Craig  ...  145.3                3.3
Casino Royale         1967     David Niven  ...   85.0                NaN
Diamonds Are Forever  1971    Sean Connery  ...   34.7                5.8
Die Another Day       2002  Pierce Brosnan  ...  154.2               17.9

[5 rows x 6 columns]

In [0]:
bond.rename(columns = {"Year" : "Release Date", "Box Office" : "Revenue"}, inplace = True)

In [291]:
bond.head()

                      Release Date           Actor  ... Budget  Bond Actor Salary
Film                                                ...
A View to a Kill              1985     Roger Moore  ...   54.5                9.1
Casino Royale                 2006    Daniel Craig  ...  145.3                3.3
Casino Royale                 1967     David Niven  ...   85.0                NaN
Diamonds Are Forever          1971    Sean Connery  ...   34.7                5.8
Die Another Day               2002  Pierce Brosnan  ...  154.2               17.9

[5 rows x 6 columns]

In [0]:
bond.rename(index = {"Dr. No" : "Doctor No", 
                     "GoldenEye" : "Golden Eye",
                     "The World Is Not Enough" : "Best Bond Movie Ever"}, 
                     inplace = True)

In [294]:
bond.loc[:]

                                 Release Date  ... Bond Actor Salary
Film                                           ...
A View to a Kill                         1985  ...               9.1
Casino Royale                            2006  ...               3.3
Casino Royale                            1967  ...               NaN
Diamonds Are Forever                     1971  ...               5.8
Die Another Day                          2002  ...              17.9
Doctor No                                1962  ...               0.6
For Your Eyes Only                       1981  ...               NaN
From Russia with Love                    1963  ...               1.6
Golden Eye                               1995  ...               5.1
Goldfinger                               1964  ...               3.2
Licence to Kill                          1989  ...               7.9
Live and Let Die                         1973  ...               NaN
Moonraker                                1979  ...               NaN
Never Say Never Again                    1983  ...               NaN
Octopussy                                1983  ...               7.8
On Her Majesty's Secret Service          1969  ...               0.6
Quantum of Solace                        2008  ...               8.1
Skyfall                                  2012  ...              14.5
Spectre                                  2015  ...               NaN
The Living Daylights                     1987  ...               5.2
The Man with the Golden Gun              1974  ...               NaN
The Spy Who Loved Me                     1977  ...               NaN
Best Bond Movie Ever                     1999  ...              13.5
Thunderball                              1965  ...               4.7
Tomorrow Never Dies                      1997  ...              10.0
You Only Live Twice                      1967  ...               4.4

[26 rows x 6 columns]

In [295]:
bond.loc["Best Bond Movie Ever"]

Release Date                   1999
Actor                Pierce Brosnan
Director              Michael Apted
Revenue                       439.5
Budget                        158.3
Bond Actor Salary              13.5
Name: Best Bond Movie Ever, dtype: object

In [296]:
bond.head()

                      Release Date           Actor  ... Budget  Bond Actor Salary
Film                                                ...
A View to a Kill              1985     Roger Moore  ...   54.5                9.1
Casino Royale                 2006    Daniel Craig  ...  145.3                3.3
Casino Royale                 1967     David Niven  ...   85.0                NaN
Diamonds Are Forever          1971    Sean Connery  ...   34.7                5.8
Die Another Day               2002  Pierce Brosnan  ...  154.2               17.9

[5 rows x 6 columns]

In [0]:
bond.columns = ["Year of Release", "Actor", "Director", "Gross", "Cost", "Salary"]

In [298]:
bond.head()

                      Year of Release           Actor  ...   Cost  Salary
Film                                                   ...
A View to a Kill                 1985     Roger Moore  ...   54.5     9.1
Casino Royale                    2006    Daniel Craig  ...  145.3     3.3
Casino Royale                    1967     David Niven  ...   85.0     NaN
Diamonds Are Forever             1971    Sean Connery  ...   34.7     5.8
Die Another Day                  2002  Pierce Brosnan  ...  154.2    17.9

[5 rows x 6 columns]

***The `.drop()` Method***

In [304]:
import pandas as pd
bond = pd.read_csv(path + "jamesbond.csv", index_col = "Film")
bond.sort_index(inplace = True)
bond.head()

                      Year           Actor  ... Budget  Bond Actor Salary
Film                                        ...
A View to a Kill      1985     Roger Moore  ...   54.5                9.1
Casino Royale         2006    Daniel Craig  ...  145.3                3.3
Casino Royale         1967     David Niven  ...   85.0                NaN
Diamonds Are Forever  1971    Sean Connery  ...   34.7                5.8
Die Another Day       2002  Pierce Brosnan  ...  154.2               17.9

[5 rows x 6 columns]

In [0]:
bond.drop(labels = ["Box Office", "Bond Actor Salary", "Actor"], axis = "columns", inplace = True)

In [306]:
bond.head()

                      Year         Director  Budget
Film
A View to a Kill      1985        John Glen    54.5
Casino Royale         2006  Martin Campbell   145.3
Casino Royale         1967       Ken Hughes    85.0
Diamonds Are Forever  1971     Guy Hamilton    34.7
Die Another Day       2002     Lee Tamahori   154.2

In [0]:
bond.drop(labels = ["A View to a Kill", "Diamonds Are Forever", "Die Another Day"], axis = "index", inplace = True)

In [308]:
bond.head()

                       Year         Director  Budget
Film
Casino Royale          2006  Martin Campbell   145.3
Casino Royale          1967       Ken Hughes    85.0
Dr. No                 1962    Terence Young     7.0
For Your Eyes Only     1981        John Glen    60.2
From Russia with Love  1963    Terence Young    12.6

***The  `.pop()` Method***

In [0]:
actor = bond.pop("Budget")

In [310]:
actor.head()

Film
Casino Royale            145.3
Casino Royale             85.0
Dr. No                     7.0
For Your Eyes Only        60.2
From Russia with Love     12.6
Name: Budget, dtype: float64

In [311]:
bond.head()

                       Year         Director
Film
Casino Royale          2006  Martin Campbell
Casino Royale          1967       Ken Hughes
Dr. No                 1962    Terence Young
For Your Eyes Only     1981        John Glen
From Russia with Love  1963    Terence Young

***The `del` Keyword***

In [0]:
del bond["Director"]

In [313]:
bond.head()

                       Year
Film
Casino Royale          2006
Casino Royale          1967
Dr. No                 1962
For Your Eyes Only     1981
From Russia with Love  1963

***The `.sample()` Method***

In [314]:
bond = pd.read_csv(path + "jamesbond.csv", index_col = "Film")
bond.sort_index(inplace = True)
bond.head()

                      Year           Actor  ... Budget  Bond Actor Salary
Film                                        ...
A View to a Kill      1985     Roger Moore  ...   54.5                9.1
Casino Royale         2006    Daniel Craig  ...  145.3                3.3
Casino Royale         1967     David Niven  ...   85.0                NaN
Diamonds Are Forever  1971    Sean Connery  ...   34.7                5.8
Die Another Day       2002  Pierce Brosnan  ...  154.2               17.9

[5 rows x 6 columns]

In [315]:
bond.sample(n = 3, axis = "columns").head()

                               Actor  Budget  Box Office
Film
A View to a Kill         Roger Moore    54.5       275.2
Casino Royale           Daniel Craig   145.3       581.5
Casino Royale            David Niven    85.0       315.0
Diamonds Are Forever    Sean Connery    34.7       442.5
Die Another Day       Pierce Brosnan   154.2       465.4

In [317]:
bond.sample(n = 5, axis = "index").head()

                    Year         Actor  ... Budget  Bond Actor Salary
Film                                    ...
Moonraker           1979   Roger Moore  ...   91.5                NaN
Thunderball         1965  Sean Connery  ...   41.9                4.7
Casino Royale       1967   David Niven  ...   85.0                NaN
For Your Eyes Only  1981   Roger Moore  ...   60.2                NaN
Live and Let Die    1973   Roger Moore  ...   30.8                NaN

[5 rows x 6 columns]

***The `.nsmallest()` and `.nlargest()` Methods***

In [318]:
bond = pd.read_csv(path + "jamesbond.csv", index_col = "Film")
bond.sort_index(inplace = True)
bond.head()

                      Year           Actor  ... Budget  Bond Actor Salary
Film                                        ...
A View to a Kill      1985     Roger Moore  ...   54.5                9.1
Casino Royale         2006    Daniel Craig  ...  145.3                3.3
Casino Royale         1967     David Niven  ...   85.0                NaN
Diamonds Are Forever  1971    Sean Connery  ...   34.7                5.8
Die Another Day       2002  Pierce Brosnan  ...  154.2               17.9

[5 rows x 6 columns]

In [319]:
bond.sort_values("Box Office", ascending = False).head()

               Year         Actor  ... Budget  Bond Actor Salary
Film                               ...
Skyfall        2012  Daniel Craig  ...  170.2               14.5
Thunderball    1965  Sean Connery  ...   41.9                4.7
Goldfinger     1964  Sean Connery  ...   18.6                3.2
Spectre        2015  Daniel Craig  ...  206.3                NaN
Casino Royale  2006  Daniel Craig  ...  145.3                3.3

[5 rows x 6 columns]

In [320]:
bond.nlargest(n = 3, columns = "Box Office")

             Year         Actor  ... Budget  Bond Actor Salary
Film                             ...
Skyfall      2012  Daniel Craig  ...  170.2               14.5
Thunderball  1965  Sean Connery  ...   41.9                4.7
Goldfinger   1964  Sean Connery  ...   18.6                3.2

[3 rows x 6 columns]

In [321]:
bond.nsmallest(n = 2, columns = "Box Office")

                  Year           Actor  ... Budget  Bond Actor Salary
Film                                    ...
Licence to Kill   1989  Timothy Dalton  ...   56.7                7.9
A View to a Kill  1985     Roger Moore  ...   54.5                9.1

[2 rows x 6 columns]

In [324]:
bond["Box Office"].nlargest(3)

Film
Skyfall        943.5
Thunderball    848.1
Goldfinger     820.4
Name: Box Office, dtype: float64

In [325]:
bond["Box Office"].nsmallest(2)

Film
Licence to Kill     250.9
A View to a Kill    275.2
Name: Box Office, dtype: float64

***The `.where()` Method***

In [326]:
bond = pd.read_csv(path + "jamesbond.csv", index_col = "Film")
bond.sort_index(inplace = True)
bond.head()

                      Year           Actor  ... Budget  Bond Actor Salary
Film                                        ...
A View to a Kill      1985     Roger Moore  ...   54.5                9.1
Casino Royale         2006    Daniel Craig  ...  145.3                3.3
Casino Royale         1967     David Niven  ...   85.0                NaN
Diamonds Are Forever  1971    Sean Connery  ...   34.7                5.8
Die Another Day       2002  Pierce Brosnan  ...  154.2               17.9

[5 rows x 6 columns]

In [327]:
mask1 = bond["Actor"] == "Sean Connery"
bond[mask1]

                       Year         Actor  ... Budget  Bond Actor Salary
Film                                       ...
Diamonds Are Forever   1971  Sean Connery  ...   34.7                5.8
Dr. No                 1962  Sean Connery  ...    7.0                0.6
From Russia with Love  1963  Sean Connery  ...   12.6                1.6
Goldfinger             1964  Sean Connery  ...   18.6                3.2
Never Say Never Again  1983  Sean Connery  ...   86.0                NaN
Thunderball            1965  Sean Connery  ...   41.9                4.7
You Only Live Twice    1967  Sean Connery  ...   59.9                4.4

[7 rows x 6 columns]

In [328]:
bond.where(mask1)

                                   Year  ... Bond Actor Salary
Film                                     ...
A View to a Kill                    NaN  ...               NaN
Casino Royale                       NaN  ...               NaN
Casino Royale                       NaN  ...               NaN
Diamonds Are Forever             1971.0  ...               5.8
Die Another Day                     NaN  ...               NaN
Dr. No                           1962.0  ...               0.6
For Your Eyes Only                  NaN  ...               NaN
From Russia with Love            1963.0  ...               1.6
GoldenEye                           NaN  ...               NaN
Goldfinger                       1964.0  ...               3.2
Licence to Kill                     NaN  ...               NaN
Live and Let Die                    NaN  ...               NaN
Moonraker                           NaN  ...               NaN
Never Say Never Again            1983.0  ...               NaN
Octopussy                           NaN  ...               NaN
On Her Majesty's Secret Service     NaN  ...               NaN
Quantum of Solace                   NaN  ...               NaN
Skyfall                             NaN  ...               NaN
Spectre                             NaN  ...               NaN
The Living Daylights                NaN  ...               NaN
The Man with the Golden Gun         NaN  ...               NaN
The Spy Who Loved Me                NaN  ...               NaN
The World Is Not Enough             NaN  ...               NaN
Thunderball                      1965.0  ...               4.7
Tomorrow Never Dies                 NaN  ...               NaN
You Only Live Twice              1967.0  ...               4.4

[26 rows x 6 columns]

In [329]:
bond.where(bond["Box Office"] > 800)

                                   Year  ... Bond Actor Salary
Film                                     ...
A View to a Kill                    NaN  ...               NaN
Casino Royale                       NaN  ...               NaN
Casino Royale                       NaN  ...               NaN
Diamonds Are Forever                NaN  ...               NaN
Die Another Day                     NaN  ...               NaN
Dr. No                              NaN  ...               NaN
For Your Eyes Only                  NaN  ...               NaN
From Russia with Love               NaN  ...               NaN
GoldenEye                           NaN  ...               NaN
Goldfinger                       1964.0  ...               3.2
Licence to Kill                     NaN  ...               NaN
Live and Let Die                    NaN  ...               NaN
Moonraker                           NaN  ...               NaN
Never Say Never Again               NaN  ...               NaN
Octopussy                           NaN  ...               NaN
On Her Majesty's Secret Service     NaN  ...               NaN
Quantum of Solace                   NaN  ...               NaN
Skyfall                          2012.0  ...              14.5
Spectre                             NaN  ...               NaN
The Living Daylights                NaN  ...               NaN
The Man with the Golden Gun         NaN  ...               NaN
The Spy Who Loved Me                NaN  ...               NaN
The World Is Not Enough             NaN  ...               NaN
Thunderball                      1965.0  ...               4.7
Tomorrow Never Dies                 NaN  ...               NaN
You Only Live Twice                 NaN  ...               NaN

[26 rows x 6 columns]

In [0]:
mask2 = bond["Box Office"] > 800

In [331]:
bond.where(mask & mask2)

                                   Year  ... Bond Actor Salary
Film                                     ...
A View to a Kill                    NaN  ...               NaN
Casino Royale                       NaN  ...               NaN
Casino Royale                       NaN  ...               NaN
Diamonds Are Forever                NaN  ...               NaN
Die Another Day                     NaN  ...               NaN
Dr. No                              NaN  ...               NaN
For Your Eyes Only                  NaN  ...               NaN
From Russia with Love               NaN  ...               NaN
GoldenEye                           NaN  ...               NaN
Goldfinger                       1964.0  ...               3.2
Licence to Kill                     NaN  ...               NaN
Live and Let Die                    NaN  ...               NaN
Moonraker                           NaN  ...               NaN
Never Say Never Again               NaN  ...               NaN
Octopussy                           NaN  ...               NaN
On Her Majesty's Secret Service     NaN  ...               NaN
Quantum of Solace                   NaN  ...               NaN
Skyfall                             NaN  ...               NaN
Spectre                             NaN  ...               NaN
The Living Daylights                NaN  ...               NaN
The Man with the Golden Gun         NaN  ...               NaN
The Spy Who Loved Me                NaN  ...               NaN
The World Is Not Enough             NaN  ...               NaN
Thunderball                      1965.0  ...               4.7
Tomorrow Never Dies                 NaN  ...               NaN
You Only Live Twice                 NaN  ...               NaN

[26 rows x 6 columns]

***The `.query()` Method***

In [332]:
bond = pd.read_csv(path + "jamesbond.csv", index_col = "Film")
bond.sort_index(inplace = True)
bond.head()

                      Year           Actor  ... Budget  Bond Actor Salary
Film                                        ...
A View to a Kill      1985     Roger Moore  ...   54.5                9.1
Casino Royale         2006    Daniel Craig  ...  145.3                3.3
Casino Royale         1967     David Niven  ...   85.0                NaN
Diamonds Are Forever  1971    Sean Connery  ...   34.7                5.8
Die Another Day       2002  Pierce Brosnan  ...  154.2               17.9

[5 rows x 6 columns]

In [334]:
bond.columns = [column_name.replace(" ", "_") for column_name in bond.columns]
bond.head()

                      Year           Actor  ... Budget  Bond_Actor_Salary
Film                                        ...
A View to a Kill      1985     Roger Moore  ...   54.5                9.1
Casino Royale         2006    Daniel Craig  ...  145.3                3.3
Casino Royale         1967     David Niven  ...   85.0                NaN
Diamonds Are Forever  1971    Sean Connery  ...   34.7                5.8
Die Another Day       2002  Pierce Brosnan  ...  154.2               17.9

[5 rows x 6 columns]

In [335]:
bond.query('Actor == "Sean Connery"')

                       Year         Actor  ... Budget  Bond_Actor_Salary
Film                                       ...
Diamonds Are Forever   1971  Sean Connery  ...   34.7                5.8
Dr. No                 1962  Sean Connery  ...    7.0                0.6
From Russia with Love  1963  Sean Connery  ...   12.6                1.6
Goldfinger             1964  Sean Connery  ...   18.6                3.2
Never Say Never Again  1983  Sean Connery  ...   86.0                NaN
Thunderball            1965  Sean Connery  ...   41.9                4.7
You Only Live Twice    1967  Sean Connery  ...   59.9                4.4

[7 rows x 6 columns]

In [337]:
bond.query('Director == "Terence Young"')

                       Year         Actor  ... Budget  Bond_Actor_Salary
Film                                       ...
Dr. No                 1962  Sean Connery  ...    7.0                0.6
From Russia with Love  1963  Sean Connery  ...   12.6                1.6
Thunderball            1965  Sean Connery  ...   41.9                4.7

[3 rows x 6 columns]

In [338]:
bond.query('Actor != "Roger Moore"')

                                 Year  ... Bond_Actor_Salary
Film                                   ...
Casino Royale                    2006  ...               3.3
Casino Royale                    1967  ...               NaN
Diamonds Are Forever             1971  ...               5.8
Die Another Day                  2002  ...              17.9
Dr. No                           1962  ...               0.6
From Russia with Love            1963  ...               1.6
GoldenEye                        1995  ...               5.1
Goldfinger                       1964  ...               3.2
Licence to Kill                  1989  ...               7.9
Never Say Never Again            1983  ...               NaN
On Her Majesty's Secret Service  1969  ...               0.6
Quantum of Solace                2008  ...               8.1
Skyfall                          2012  ...              14.5
Spectre                          2015  ...               NaN
The Living Daylights             1987  ...               5.2
The World Is Not Enough          1999  ...              13.5
Thunderball                      1965  ...               4.7
Tomorrow Never Dies              1997  ...              10.0
You Only Live Twice              1967  ...               4.4

[19 rows x 6 columns]

In [339]:
bond.query("Box_Office > 600")

             Year         Actor  ... Budget  Bond_Actor_Salary
Film                             ...
Goldfinger   1964  Sean Connery  ...   18.6                3.2
Skyfall      2012  Daniel Craig  ...  170.2               14.5
Spectre      2015  Daniel Craig  ...  206.3                NaN
Thunderball  1965  Sean Connery  ...   41.9                4.7

[4 rows x 6 columns]

In [340]:
bond.query("Actor == 'Roger Moore' and Director == 'John Glen'")

                    Year        Actor  ... Budget  Bond_Actor_Salary
Film                                   ...
A View to a Kill    1985  Roger Moore  ...   54.5                9.1
For Your Eyes Only  1981  Roger Moore  ...   60.2                NaN
Octopussy           1983  Roger Moore  ...   53.9                7.8

[3 rows x 6 columns]

In [0]:
bond.query("Actor in ['Timothy Dalton', 'George Lazenby']")

,Year,Actor,Director,Box_Office,Budget,Bond_Actor_Salary
Film,,,,,,
Licence to Kill,1989,Timothy Dalton,John Glen,250.9,56.7,7.9
On Her Majesty's Secret Service,1969,George Lazenby,Peter R. Hunt,291.5,37.3,0.6
The Living Daylights,1987,Timothy Dalton,John Glen,313.5,68.8,5.2

In [0]:
bond.query("Actor not in ['Sean Connery', 'Roger Moore']")

,Year,Actor,Director,Box_Office,Budget,Bond_Actor_Salary
Film,,,,,,
Casino Royale,2006,Daniel Craig,Martin Campbell,581.5,145.3,3.3
Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN
Die Another Day,2002,Pierce Brosnan,Lee Tamahori,465.4,154.2,17.9
GoldenEye,1995,Pierce Brosnan,Martin Campbell,518.5,76.9,5.1
Licence to Kill,1989,Timothy Dalton,John Glen,250.9,56.7,7.9
On Her Majesty's Secret Service,1969,George Lazenby,Peter R. Hunt,291.5,37.3,0.6
Quantum of Solace,2008,Daniel Craig,Marc Forster,514.2,181.4,8.1
Skyfall,2012,Daniel Craig,Sam Mendes,943.5,170.2,14.5
Spectre,2015,Daniel Craig,Sam Mendes,726.7,206.3,NaN
The Living Daylights,1987,Timothy Dalton,John Glen,313.5,68.8,5.2
The World Is Not Enough,1999,Pierce Brosnan,Michael Apted,439.5,158.3,13.5
Tomorrow Never Dies,1997,Pierce Brosnan,Roger Spottiswoode,463.2,133.9,10.0

***The `.apply()` Method on `Single or Multiple Columns`***

In [341]:
bond = pd.read_csv(path + "jamesbond.csv", index_col = "Film")
bond.sort_index(inplace = True)
bond.head()

                      Year           Actor  ... Budget  Bond Actor Salary
Film                                        ...
A View to a Kill      1985     Roger Moore  ...   54.5                9.1
Casino Royale         2006    Daniel Craig  ...  145.3                3.3
Casino Royale         1967     David Niven  ...   85.0                NaN
Diamonds Are Forever  1971    Sean Connery  ...   34.7                5.8
Die Another Day       2002  Pierce Brosnan  ...  154.2               17.9

[5 rows x 6 columns]

In [0]:
def convert_to_string_and_add_millions(number):
    return str(number) + " MILLIONS!"

In [0]:
columns = ["Box Office", "Budget", "Bond Actor Salary"]
for col in columns:
    bond[col] = bond[col].apply(convert_to_string_and_add_millions)

In [344]:
bond.head()

                      Year           Actor  ...           Budget Bond Actor Salary
Film                                        ...
A View to a Kill      1985     Roger Moore  ...   54.5 MILLIONS!     9.1 MILLIONS!
Casino Royale         2006    Daniel Craig  ...  145.3 MILLIONS!     3.3 MILLIONS!
Casino Royale         1967     David Niven  ...   85.0 MILLIONS!     nan MILLIONS!
Diamonds Are Forever  1971    Sean Connery  ...   34.7 MILLIONS!     5.8 MILLIONS!
Die Another Day       2002  Pierce Brosnan  ...  154.2 MILLIONS!    17.9 MILLIONS!

[5 rows x 6 columns]

***The `.apply()` Method with `Row Values`***

In [345]:
bond = pd.read_csv(path + "jamesbond.csv", index_col = "Film")
bond.sort_index(inplace = True)
bond.head()

                      Year           Actor  ... Budget  Bond Actor Salary
Film                                        ...
A View to a Kill      1985     Roger Moore  ...   54.5                9.1
Casino Royale         2006    Daniel Craig  ...  145.3                3.3
Casino Royale         1967     David Niven  ...   85.0                NaN
Diamonds Are Forever  1971    Sean Connery  ...   34.7                5.8
Die Another Day       2002  Pierce Brosnan  ...  154.2               17.9

[5 rows x 6 columns]

In [346]:
def good_movie(row):
  
    actor = row[1]
    budget = row[4]
    
    if actor == "Pierce Brosnan":
        return "The best"
    elif actor == "Roger Moore" and budget > 40:
        return "Enjoyable"
    else:
        return "I have no clue"
    
bond.apply(good_movie, axis = "columns")

Film
A View to a Kill                        Enjoyable
Casino Royale                      I have no clue
Casino Royale                      I have no clue
Diamonds Are Forever               I have no clue
Die Another Day                          The best
Dr. No                             I have no clue
For Your Eyes Only                      Enjoyable
From Russia with Love              I have no clue
GoldenEye                                The best
Goldfinger                         I have no clue
Licence to Kill                    I have no clue
Live and Let Die                   I have no clue
Moonraker                               Enjoyable
Never Say Never Again              I have no clue
Octopussy                               Enjoyable
On Her Majesty's Secret Service    I have no clue
Quantum of Solace                  I have no clue
Skyfall                            I have no clue
Spectre                            I have no clue
The Living Daylights               I have no clue
The Man with the Golden Gun        I have no clue
The Spy Who Loved Me                    Enjoyable
The World Is Not Enough                  The best
Thunderball                        I have no clue
Tomorrow Never Dies                      The best
You Only Live Twice                I have no clue
dtype: object

***The `.copy()` Method***

In [348]:
bond = pd.read_csv(path + "jamesbond.csv", index_col = "Film")
bond.sort_index(inplace = True)
bond.head()

                      Year           Actor  ... Budget  Bond Actor Salary
Film                                        ...
A View to a Kill      1985     Roger Moore  ...   54.5                9.1
Casino Royale         2006    Daniel Craig  ...  145.3                3.3
Casino Royale         1967     David Niven  ...   85.0                NaN
Diamonds Are Forever  1971    Sean Connery  ...   34.7                5.8
Die Another Day       2002  Pierce Brosnan  ...  154.2               17.9

[5 rows x 6 columns]

In [349]:
directors = bond["Director"]
directors.head()

Film
A View to a Kill              John Glen
Casino Royale           Martin Campbell
Casino Royale                Ken Hughes
Diamonds Are Forever       Guy Hamilton
Die Another Day            Lee Tamahori
Name: Director, dtype: object

In [350]:
directors["A View to a Kill"] = "Mister John Glen"

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [351]:
directors.head()

Film
A View to a Kill        Mister John Glen
Casino Royale            Martin Campbell
Casino Royale                 Ken Hughes
Diamonds Are Forever        Guy Hamilton
Die Another Day             Lee Tamahori
Name: Director, dtype: object

In [352]:
bond.head(3)

                  Year         Actor  ... Budget  Bond Actor Salary
Film                                  ...
A View to a Kill  1985   Roger Moore  ...   54.5                9.1
Casino Royale     2006  Daniel Craig  ...  145.3                3.3
Casino Royale     1967   David Niven  ...   85.0                NaN

[3 rows x 6 columns]

In [354]:
bond = pd.read_csv(path + "jamesbond.csv", index_col = "Film")
bond.sort_index(inplace = True)
bond.head()

                      Year           Actor  ... Budget  Bond Actor Salary
Film                                        ...
A View to a Kill      1985     Roger Moore  ...   54.5                9.1
Casino Royale         2006    Daniel Craig  ...  145.3                3.3
Casino Royale         1967     David Niven  ...   85.0                NaN
Diamonds Are Forever  1971    Sean Connery  ...   34.7                5.8
Die Another Day       2002  Pierce Brosnan  ...  154.2               17.9

[5 rows x 6 columns]

In [357]:
directors = bond["Director"].copy() # directors = bond["Director"][:] this is also another way
directors.head(3)

Film
A View to a Kill          John Glen
Casino Royale       Martin Campbell
Casino Royale            Ken Hughes
Name: Director, dtype: object

In [0]:
directors["A View to a Kill"] = "Mister John Glen"

In [359]:
directors.head(3)

Film
A View to a Kill    Mister John Glen
Casino Royale        Martin Campbell
Casino Royale             Ken Hughes
Name: Director, dtype: object

In [360]:
bond.head(3)

                  Year         Actor  ... Budget  Bond Actor Salary
Film                                  ...
A View to a Kill  1985   Roger Moore  ...   54.5                9.1
Casino Royale     2006  Daniel Craig  ...  145.3                3.3
Casino Royale     1967   David Niven  ...   85.0                NaN

[3 rows x 6 columns]